# Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

lst = ["qwe", "asd", "zxc", "qwe", "ertqwe"]

str = input('Введите строку для поиска: ')

if lst.count(str) >= 2:
    lst.remove(str)
    print(f' Индекс второго вхождения строки {str}: {lst.index(str) + 1}')
elif str not in lst:
    print(f'Строки {str} в заданном списке нет')
else:
    print(f'Второго вхождения строки {str} в заданном списке нет')